import styles from "./about-us.module.sass";
import { MarqueeText } from "../marquee/marquee.tsx";

export const AboutUs = () => {
  return (
    <section className={styles["about-us"]}>
      <div className={styles["about-us__container"]}>
        <h1 className={styles["about-us__heading"]}>Что такое PetPortal?</h1>
        <div className={styles["about-us__info"]}>
          <div className={styles["about-us__first-part-info"]}>
            <div>
              <svg
                className={styles["about-us__first-part-icon"]}
                xmlns="http://www.w3.org/2000/svg"
                width="93"
                height="93"
                viewBox="0 0 93 93"
                fill="none"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M88 46.5C88 69.4198 69.4198 88 46.5 88C23.5802 88 5 69.4198 5 46.5C5 23.5802 23.5802 5 46.5 5C69.4198 5 88 23.5802 88 46.5ZM93 46.5C93 72.1812 72.1812 93 46.5 93C20.8188 93 0 72.1812 0 46.5C0 20.8188 20.8188 0 46.5 0C72.1812 0 93 20.8188 93 46.5ZM35.1035 63.3848C35.3574 63.7949 35.7578 64 36.3047 64H56.5195C57.0664 64 57.4668 63.7949 57.7207 63.3848C57.9746 62.9551 58.1016 62.291 58.1016 61.3926V60.5137C58.1016 59.6152 57.9746 58.9609 57.7207 58.5508C57.4668 58.1211 57.0664 57.9062 56.5195 57.9062H50.9531V28.5801C50.9531 28.2871 50.6992 28.0039 50.1914 27.7305C49.7031 27.457 49.2441 27.3203 48.8145 27.3203L35.8359 29.7227C35.4062 29.8008 35.0742 29.9668 34.8398 30.2207C34.6055 30.4551 34.4883 30.7676 34.4883 31.1582C34.4883 32.1934 34.6152 33.1895 34.8691 34.1465C35.1426 35.084 35.5723 35.5527 36.1582 35.5527L43.248 34.498V57.9062H36.3047C35.7578 57.9062 35.3574 58.1113 35.1035 58.5215C34.8691 58.9316 34.752 59.5957 34.752 60.5137V61.3926C34.752 62.3105 34.8691 62.9746 35.1035 63.3848Z"
                  fill="white"
                />
              </svg>
            </div>
            <p>
              PetPortal - площадка для работодателей, HR&nbsp;специалистов, и
              заказчиков проектов. Есть заказ? Разместите его на нашем сайте.
              Платформа помогает в поиске новых сотрудников и аутсорсинга
              IT-задач
            </p>
          </div>
          <div className={styles["about-us__second-part-info"]}>
            <div>
              <svg
                className={styles["about-us__second-part-icon"]}
                xmlns="http://www.w3.org/2000/svg"
                width="93"
                height="93"
                viewBox="0 0 93 93"
                fill="none"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M88 46.5C88 69.4198 69.4198 88 46.5 88C23.5802 88 5 69.4198 5 46.5C5 23.5802 23.5802 5 46.5 5C69.4198 5 88 23.5802 88 46.5ZM93 46.5C93 72.1812 72.1812 93 46.5 93C20.8188 93 0 72.1812 0 46.5C0 20.8188 20.8188 0 46.5 0C72.1812 0 93 20.8188 93 46.5ZM34.7227 62.3594C35.0352 63.4531 35.377 64 35.748 64H56.4609C57.0078 64 57.4082 63.7949 57.6621 63.3848C57.916 62.9551 58.043 62.291 58.043 61.3926V60.5137C58.043 59.6152 57.916 58.9609 57.6621 58.5508C57.4082 58.1211 57.0078 57.9062 56.4609 57.9062H44.4492L54.2344 45.8066C55.2305 44.5957 56.002 43.2773 56.5488 41.8516C57.1152 40.4258 57.3984 38.9121 57.3984 37.3105C57.3984 35.3184 56.959 33.5605 56.0801 32.0371C55.2012 30.4941 53.9023 29.293 52.1836 28.4336C50.4844 27.5547 48.4434 27.1152 46.0605 27.1152C44.3613 27.1152 42.7109 27.3105 41.1094 27.7012C39.5273 28.0723 38.2285 28.6289 37.2129 29.3711C36.1973 30.0938 35.6895 30.9434 35.6895 31.9199C35.6895 32.3887 35.8262 32.9062 36.0996 33.4727C36.373 34.0391 36.7344 34.5176 37.1836 34.9082C37.6523 35.2988 38.1406 35.4941 38.6484 35.4941C38.8047 35.4941 39 35.4355 39.2344 35.3184C39.4688 35.2012 39.7129 35.0547 39.9668 34.8789C40.7285 34.3906 41.4707 34 42.1934 33.707C42.9355 33.4141 43.7852 33.2676 44.7422 33.2676C46.1875 33.2676 47.3594 33.6387 48.2578 34.3809C49.1562 35.1035 49.6055 36.1387 49.6055 37.4863C49.6055 39.166 48.9414 40.8359 47.6133 42.4961L34.4297 58.6094C34.332 58.8047 34.2832 59.0684 34.2832 59.4004C34.2832 60.2793 34.4297 61.2656 34.7227 62.3594Z"
                  fill="white"
                />
              </svg>
            </div>
            <p>
              PetPortal - площадка для объединения разработчиков и совместного
              создания pet&nbsp;проектов. Широкий выбор проектов и умный
              помощник PetAssist поможет каждому найти проект себе по душе
            </p>
          </div>
        </div>
      </div>
      <div>
        <MarqueeText
          styleName="about-us__upper-running-text"
          direction="right"
        />
        <MarqueeText
          styleName="about-us__lower-running-text"
          direction="left"
        />
      </div>
    </section>
  );
};
